n5/src/Catalogs/Organizations/Organizations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Organizations</name>
  <basedOn>Catalog.Leads</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Address</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>Alien</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApproveSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Birthday</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Birthplace</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>Chain</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>CodeFiscal</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Contact</name>
    <type>
      <types>CatalogRef.Contacts</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerContract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerType</name>
    <type>
      <types>EnumRef.CustomerTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>Fax</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>FullDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>Government</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GroupsUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>Individual</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Issued</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IssuedBy</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ItemsUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Lead</name>
    <type>
      <types>CatalogRef.Leads</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ObjectUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentContact</name>
    <type>
      <types>CatalogRef.Contacts</types>
    </type>
  </attributes>
  <attributes>
    <name>Phone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Policy</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Salesman</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShippingAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>ShippingContact</name>
    <type>
      <types>CatalogRef.Contacts</types>
    </type>
  </attributes>
  <attributes>
    <name>SIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TaxCode</name>
    <type>
      <types>CatalogRef.TaxCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxGroup</name>
    <type>
      <types>CatalogRef.TaxGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>ValidTo</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Vendor</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorContract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>Web</name>
    <type>
      <types>DefinedType.Web</types>
    </type>
  </attributes>
  <attributes>
    <name>Wholesaler</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ApprovalList</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
    <attributes>
      <name>Priority</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Properties</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.Properties</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.Properties</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

n5/src/Enums/PropertiesUsage/PropertiesUsage.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PropertiesUsage</name>
  <enumValues>
    <name>Inherit</name>
  </enumValues>
  <enumValues>
    <name>Special</name>
  </enumValues>
  <enumValues>
    <name>None</name>
  </enumValues>
</mdclass:Enum>

n5/src/Enums/PropertiesScope/PropertiesScope.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PropertiesScope</name>
  <enumValues>
    <name>Item</name>
  </enumValues>
  <enumValues>
    <name>Groups</name>
  </enumValues>
  <enumValues>
    <name>Items</name>
  </enumValues>
</mdclass:Enum>

n5/src/Catalogs/Organizations/Forms/Folder/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	OptionalProperties.Load ( ThisObject );
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( Object.Ref.IsEmpty () ) then
		OptionalProperties.Load ( ThisObject );
		fillNew ();
	endif; 
	OptionalProperties.Access ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|PropertiesGroup show inlist ( Object.ObjectUsage, Enum.PropertiesUsage.Inherit, Enum.PropertiesUsage.Special );
	|OpenObjectUsage enable inlist ( Object.ObjectUsage, Enum.PropertiesUsage.Inherit, Enum.PropertiesUsage.Special );
	|OpenGroupsUsage enable inlist ( Object.GroupsUsage, Enum.PropertiesUsage.Inherit, Enum.PropertiesUsage.Special );
	|OpenItemsUsage enable inlist ( Object.ItemsUsage, Enum.PropertiesUsage.Inherit, Enum.PropertiesUsage.Special );
	|Description lock PropertiesData.ChangeName;
	|FullDescription lock PropertiesData.ChangeDescription
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure fillNew ()
	
	if ( Parameters.FillingText <> "" ) then
		setFullDescription ( ThisObject );
	endif; 
	
EndProcedure 

&AtClientAtServerNoContext
Procedure setFullDescription ( Form )
	
	object = Form.Object;
	object.FullDescription = object.Description;
	
EndProcedure

&AtServer
Procedure FillCheckProcessingAtServer ( Cancel, CheckedAttributes )
	
	if ( not OptionalProperties.Check ( ThisObject ) ) then
		Cancel = true;
	endif; 
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure DescriptionOnChange ( Item )
	
	setFullDescription ( ThisObject );
	
EndProcedure

&AtClient
Procedure ParentOnChange ( Item )
	
	applyParent ();
	
EndProcedure

&AtServer
Procedure applyParent ()
	
	OptionalProperties.Load ( ThisObject );
	
EndProcedure 

&AtClient
Procedure ObjectUsageOnChange ( Item )
	
	Appearance.Apply ( ThisObject, "Object.ObjectUsage" );
	
EndProcedure

&AtClient
Procedure OpenObjectUsage ( Command )
	
	OptionalProperties.Open ( ThisObject, PredefinedValue ( "Enum.PropertiesScope.Item" ), Object.ObjectUsage );
	
EndProcedure

&AtClient
Procedure GroupsUsageOnChange ( Item )
	
	Appearance.Apply ( ThisObject, "Object.GroupsUsage" );
	
EndProcedure

&AtClient
Procedure OpenGroupsUsage ( Command )
	
	OptionalProperties.Open ( ThisObject, PredefinedValue ( "Enum.PropertiesScope.Groups" ), Object.GroupsUsage );
	
EndProcedure

&AtClient
Procedure ItemsUsageOnChange ( Item )
	
	Appearance.Apply ( ThisObject, "Object.ItemsUsage" );
	
EndProcedure

&AtClient
Procedure OpenItemsUsage ( Command )
	
	OptionalProperties.Open ( ThisObject, PredefinedValue ( "Enum.PropertiesScope.Items" ), Object.ItemsUsage );
	
EndProcedure

// *****************************************
// *********** Group Properties

&AtClient
Procedure PropertiesChanged ( Changed, Form ) export
	
	updateProperties ();
	
EndProcedure 

&AtServer
Procedure updateProperties ()
	
	OptionalProperties.Load ( ThisObject );
	
EndProcedure 

&AtClient
Procedure PropertyOnChange ( Item ) export
	
	OptionalProperties.ApplyConditions ( ThisObject, Item );
	OptionalProperties.BuildDescription ( ThisObject );
	OptionalProperties.ChangeHost ( ThisObject, Item );
	
EndProcedure
